package com.kupo.ElephantHead.ui.main.model;

/**
 * 用户协议
 */
public class AgreementModel {

    /**
     * code : 0
     * data : {"text":"《Pole用户许可协议》\n\n    重要须知：《Pole用户许可协议》（以下简称\u201c本协议\u201d）是您使用（个人、公司、或其他组织）Pole-电线杆app签订的关于本软件的最终用户使用许可协议。 Pole在此特别提示您仔细阅读本协议中各条款，包括但不限于用户使用须知、法律责任与免责等。您的安装、使用行为将视为接受本协议。一旦安装或以任何方式使用本软件，即表示您已同意接受本协议的约束。如果您不同意本协议的条款，则不能获得安装、使用本软件的权利。\n    本协议是您与Pole就您下载、安装、使用本软件所订立的协议。本协议约定与您关于本软件使用许可方面的权利义务。\n    1、知识产权声明\n    本软件由Pole开发且获得软件著作（以下简称\u201c许可人\u201d）许可。本软件的知识产权以及与本软件相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图表、色彩、界面设计、版面框架、有关数据、印刷材料、电子文档等，均受著作权法和国际著作权条约以及其他知识产权法律、法规的保护，其知识产权均归Pole及其许可人所有。\n    2、软件的许可\n    （1）本协议未明示授权的其他一切权利均归Pole及其许可人所有，如果您需要使用本协议未授予的任何其他权利，须另行取得Pole的书面同意。\n    （2）您通过本软件使用第三方的应用服务，应另行与该第三方签订服务协议。\n    （3）Pole许可您在手机上下载、安装、运行本软件。该许可是有限的、不可转让的、不可分许可的、可撤销的、非独占的、非排他的。\n    （4）您只能在一台手机上下载、安装、运行本软件的一份副本。\n    3、用户账户注册\n    （1）您承诺以真实身份注册成为本软件的用户，并保证所提供的个人身份资料信息真实、完整、有效，并对您所提供的信息承担相应的法律责任。\n    （2）您以其真实身份注册成为本软件用户后，需要修改所提供的个人身份资料信息的，Pole将及时、有效地为其提供该项服务，但出于安全性和身份识别的考虑，你无法修改注册时提供的初始注册信息及其他验证信息。\n    4、用户账号使用与保管\n    （1）Pole有权审查您注册所提供的身份信息是否真实、有效，并将采取专业加密存储与传输方式等合理措施保障用户账号的安全、有效；您有义务妥善保管您的账号及密码，并正确、安全地使用您的账号及密码。任何一方未尽上述义务导致账号密码遗失、账号被盗等情形而给您和他人的民事权利造成损害的，应当承担由此产生的法律责任。\n    （2）您对登录后所持账号产生的行为依法享有权利和承担责任。\n    （3）如果您发现您的账号或密码被他人非法使用或有使用异常的情况的，应及时根据Pole公布的处理方式通知，并有权通知Pole采取措施暂停该账号的登录和使用。\n    （4）Pole根据您的通知采取措施暂停您的账号的登录和使用的，将会要求您提供并核实与其注册身份信息相一致的个人有效身份信息。\n    （5）Pole核实您所提供的个人有效身份信息与所注册的身份信息相一致的，将及时采取措施暂停您的账号的登录和使用。\n    （6）Pole违反本条第一款项的约定，未及时采取措施暂停您的账号的登录和使用，因此而给您造成损失的，将承担其相应的法律责任。\n    （7）如果您没有提供其个人有效身份证件或者您提供的个人有效身份证件与所注册的身份信息不一致的，Pole有权拒绝您的上述请求。\n    （8）当您为了维护您的合法权益，向Pole提供与所注册的身份信息相一致的个人有效身份信息时，Pole�合法权益而向乙方提起诉讼或者仲裁时；\n    （5）应您的监护人的合法要求而提供您的个人身份信息时。\n    12、其他条款\n    （1）本协议任何条款的部分或全部无效，不影响其它条款的效力。\n    （2）本协议的解释、效力及纠纷的解决，适用于中华人民共和国法律。\n    因本协议发生任何纠纷或争议，首先应友好协商解决，协商不成的，您在此完全同意将纠纷或争议提交仲裁委员会仲裁裁决，仲裁裁决是终局的，对双方具有约束力。仲裁的所有费用将由仲裁发起方承担。\n    （3）有关本软件的问题，您可拨打Pole客户服务热线咨询。\n    另外，本软件在使用过程中需访问网络，所产生的流量费用由运营商收取，详情请咨询您所属的运营商。\n    如您有任何问题，您可以和Pole联系以取得详细资讯。\n    版权所有，保留在法律许可范围内的解释权。\n\n"}
     * failCode : 0
     * message :
     */

    private int code;
    private DataBean data;
    private int failCode;
    private String message;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public int getFailCode() {
        return failCode;
    }

    public void setFailCode(int failCode) {
        this.failCode = failCode;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public static class DataBean {
        /**
         * text : 《Pole用户许可协议》

         重要须知：《Pole用户许可协议》（以下简称“本协议”）是您使用（个人、公司、或其他组织）Pole-电线杆app签订的关于本软件的最终用户使用许可协议。 Pole在此特别提示您仔细阅读本协议中各条款，包括但不限于用户使用须知、法律责任与免责等。您的安装、使用行为将视为接受本协议。一旦安装或以任何方式使用本软件，即表示您已同意接受本协议的约束。如果您不同意本协议的条款，则不能获得安装、使用本软件的权利。
         本协议是您与Pole就您下载、安装、使用本软件所订立的协议。本协议约定与您关于本软件使用许可方面的权利义务。
         1、知识产权声明
         本软件由Pole开发且获得软件著作（以下简称“许可人”）许可。本软件的知识产权以及与本软件相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图表、色彩、界面设计、版面框架、有关数据、印刷材料、电子文档等，均受著作权法和国际著作权条约以及其他知识产权法律、法规的保护，其知识产权均归Pole及其许可人所有。
         2、软件的许可
         （1）本协议未明示授权的其他一切权利均归Pole及其许可人所有，如果您需要使用本协议未授予的任何其他权利，须另行取得Pole的书面同意。
         （2）您通过本软件使用第三方的应用服务，应另行与该第三方签订服务协议。
         （3）Pole许可您在手机上下载、安装、运行本软件。该许可是有限的、不可转让的、不可分许可的、可撤销的、非独占的、非排他的。
         （4）您只能在一台手机上下载、安装、运行本软件的一份副本。
         3、用户账户注册
         （1）您承诺以真实身份注册成为本软件的用户，并保证所提供的个人身份资料信息真实、完整、有效，并对您所提供的信息承担相应的法律责任。
         （2）您以其真实身份注册成为本软件用户后，需要修改所提供的个人身份资料信息的，Pole将及时、有效地为其提供该项服务，但出于安全性和身份识别的考虑，你无法修改注册时提供的初始注册信息及其他验证信息。
         4、用户账号使用与保管
         （1）Pole有权审查您注册所提供的身份信息是否真实、有效，并将采取专业加密存储与传输方式等合理措施保障用户账号的安全、有效；您有义务妥善保管您的账号及密码，并正确、安全地使用您的账号及密码。任何一方未尽上述义务导致账号密码遗失、账号被盗等情形而给您和他人的民事权利造成损害的，应当承担由此产生的法律责任。
         （2）您对登录后所持账号产生的行为依法享有权利和承担责任。
         （3）如果您发现您的账号或密码被他人非法使用或有使用异常的情况的，应及时根据Pole公布的处理方式通知，并有权通知Pole采取措施暂停该账号的登录和使用。
         （4）Pole根据您的通知采取措施暂停您的账号的登录和使用的，将会要求您提供并核实与其注册身份信息相一致的个人有效身份信息。
         （5）Pole核实您所提供的个人有效身份信息与所注册的身份信息相一致的，将及时采取措施暂停您的账号的登录和使用。
         （6）Pole违反本条第一款项的约定，未及时采取措施暂停您的账号的登录和使用，因此而给您造成损失的，将承担其相应的法律责任。
         （7）如果您没有提供其个人有效身份证件或者您提供的个人有效身份证件与所注册的身份信息不一致的，Pole有权拒绝您的上述请求。
         （8）当您为了维护您的合法权益，向Pole提供与所注册的身份信息相一致的个人有效身份信息时，Pole�合法权益而向乙方提起诉讼或者仲裁时；
         （5）应您的监护人的合法要求而提供您的个人身份信息时。
         12、其他条款
         （1）本协议任何条款的部分或全部无效，不影响其它条款的效力。
         （2）本协议的解释、效力及纠纷的解决，适用于中华人民共和国法律。
         因本协议发生任何纠纷或争议，首先应友好协商解决，协商不成的，您在此完全同意将纠纷或争议提交仲裁委员会仲裁裁决，仲裁裁决是终局的，对双方具有约束力。仲裁的所有费用将由仲裁发起方承担。
         （3）有关本软件的问题，您可拨打Pole客户服务热线咨询。
         另外，本软件在使用过程中需访问网络，所产生的流量费用由运营商收取，详情请咨询您所属的运营商。
         如您有任何问题，您可以和Pole联系以取得详细资讯。
         版权所有，保留在法律许可范围内的解释权。


         */

        private String text;

        public String getText() {
            return text;
        }

        public void setText(String text) {
            this.text = text;
        }
    }
}
